# SheetDrawnBy Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SheetDrawnBy Property
ParameterTypeId Class See Also
---
"Drawn By"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SheetDrawnBy { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetDrawnBy As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SheetDrawnBy {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace